zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1170/MIMXRT1173/MIMXRT1173_cm4_COMMON.h
#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */

#include "core_cm4.h"                  /* Core Peripheral Access Layer */
#include "system_MIMXRT1173_cm4.h"     /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef MIMXRT1173_cm4_SERIES
#define MIMXRT1173_cm4_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT1173_cm4_features.h"

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup asrc_clock_source_mapping
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief The ASRC clock source
 */
typedef enum _asrc_clock_source
{
    kASRC_ClockSourceNotAvalible    = -1,          /**< not avalible */
    kASRC_ClockSourceBitClock0_SAI1_TX = 0U,       /**< SAI1 TX */
    kASRC_ClockSourceBitClock1_SAI1_RX = 1U,       /**< SAI1 RX */
    kASRC_ClockSourceBitClock2_SAI2_TX = 2U,       /**< SAI2 TX */
    kASRC_ClockSourceBitClock3_SAI2_RX = 3U,       /**< SAI2 RX */
    kASRC_ClockSourceBitClock4_SAI3_TX = 4U,       /**< SAI3 TX */
    kASRC_ClockSourceBitClock5_SAI3_RX = 5U,       /**< SAI3 RX */
    kASRC_ClockSourceBitClock6_SAI4_TX = 6U,       /**< SAI4 TX */
    kASRC_ClockSourceBitClock7_SAI4_RX = 7U,       /**< SAI4 RX */
    kASRC_ClockSourceBitClock8_SPDIF_TX = 8U,      /**< SPDIF TX */
    kASRC_ClockSourceBitClock9_SPDIF_RX = 9U,      /**< SPDIF RX */
    kASRC_ClockSourceBitClocka_SAI2_CLOCK_ROOT = 10U, /**< SAI2 CLOCK ROOT */
    kASRC_ClockSourceBitClockb_SAI3_CLOCK_ROOT = 11U, /**< SAI3 CLOCK ROOT */
    kASRC_ClockSourceBitClockc_SAI4_CLOCK_ROOT = 12U, /**< SAI4 CLOCK ROOT */
    kASRC_ClockSourceBitClockd_MIC_CLOCK_ROOT = 13U, /**< MIC CLOCK ROOT */
    kASRC_ClockSourceBitClocke_MQS_CLOCK_ROOT = 14U, /**< MQS CLOCK ROOT */
    kASRC_ClockSourceMax            = 14U,         /**< max value */
} asrc_clock_source_t;

/* @} */

/*!
 * @addtogroup ssarc_power_domain_name_mapping
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the SSARC mapping
 * The name of power domain.
 */
typedef enum _ssarc_power_domain_name
{
    kSSARC_MEGAMIXPowerDomain       = 0U,          /**< MEGAMIX Power Domain, request from BPC0. */
    kSSARC_DISPLAYMIXPowerDomain    = 1U,          /**< DISPLAYMIX Power Domain, request from BPC1. */
    kSSARC_WAKEUPMIXPowerDomain     = 2U,          /**< WAKEUPMIX Power Domain, request from BPC2. */
    kSSARC_LPSRMIXPowerDomain       = 3U,          /**< LPSRMIX Power Domain, request from BPC3. */
    kSSARC_PowerDomain4             = 4U,          /**< MIPI PHY Power Domain, request from BPC4. */
    kSSARC_PowerDomain5             = 5U,          /**< Virtual power domain, request from BPC5. */
    kSSARC_PowerDomain6             = 6U,          /**< Virtual power domain, request from BPC6. */
    kSSARC_PowerDomain7             = 7U,          /**< Virtual power domain, request from BPC7. */
} ssarc_power_domain_name_t;

/* @} */

/*!
 * @addtogroup ssarc_cpu_domain_name_mapping
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the SSARC mapping
 * The name of cpu domain.
 */
typedef enum _ssarc_cpu_domain_name
{
    kSSARC_CM7Core                  = 0U,          /**< CM7 Core domain. */
    kSSARC_CM4Core                  = 1U,          /**< CM4 Core domain. */
} ssarc_cpu_domain_name_t;

/* @} */

/*!
 * @addtogroup xrdc2_master_mapping
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the XRDC2 mapping
 * Defines the structure for the XRDC2 resource collections.
 */
typedef enum _xrdc2_master
{
    kXRDC2_Master_M7_AHB            = 0U,          /**< M7 AHB */
    kXRDC2_Master_M4_AHBC           = 0U,          /**< M4 AHBC */
    kXRDC2_Master_M7_AXI            = 1U,          /**< M7 AXI */
    kXRDC2_Master_M4_AHBS           = 1U,          /**< M4 AHBS */
    kXRDC2_Master_CAAM              = 2U,          /**< CAAM */
    kXRDC2_Master_CSI               = 3U,          /**< CSI */
    kXRDC2_Master_M7_EDMA           = 4U,          /**< M7 EDMA */
    kXRDC2_Master_M4_EDMA           = 4U,          /**< M4 EDMA */
    kXRDC2_Master_ENET              = 5U,          /**< ENET */
    kXRDC2_Master_ENET_1G_RX        = 6U,          /**< ENET_1G_RX */
    kXRDC2_Master_ENET_1G_TX        = 7U,          /**< ENET_1G_TX */
    kXRDC2_Master_ENET_QOS          = 8U,          /**< ENET_QOS */
    kXRDC2_Master_GPU               = 9U,          /**< GPU */
    kXRDC2_Master_LCDIF             = 10U,         /**< LCDIF */
    kXRDC2_Master_LCDIFV2           = 11U,         /**< LCDIFV2 */
    kXRDC2_Master_PXP               = 12U,         /**< PXP */
    kXRDC2_Master_SSARC             = 14U,         /**< SSARC */
    kXRDC2_Master_USB               = 15U,         /**< USB */
    kXRDC2_Master_USDHC1            = 16U,         /**< USDHC1 */
    kXRDC2_Master_USDHC2            = 17U,         /**< USDHC2 */
} xrdc2_master_t;

/* @} */

/*!
 * @addtogroup xrdc2_mem_mapping
 * @{
 */

